Revit 2027 API
IntersectionResult.UVPoint Property
2d (or two 1d) parameters of the point of intersection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV UVPoint { get; }
Public ReadOnly Property UVPoint As UV
	Get
public:
property UV^ UVPoint {
	UV^ get ();
}
member UVPoint : UV with get
Property Value
UV
Exceptions
Exception | Condition
InvalidOperationException |  Thrown in the getter when this property has not been set by the method providing the result.
See Also
Reference
IntersectionResult Class
Autodesk.Revit.DB Namespace